{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "advice/question",
    "1": "animals",
    "2": "anime/manga",
    "3": "appearance",
    "4": "arts",
    "5": "autos",
    "6": "board_game",
    "7": "books",
    "8": "card_game",
    "9": "company/website",
    "10": "crypto",
    "11": "drugs",
    "12": "education",
    "13": "electronics",
    "14": "finance/money",
    "15": "food/drink",
    "16": "geo",
    "17": "hardware/tools",
    "18": "health",
    "19": "hobby",
    "20": "meta",
    "21": "movies",
    "22": "music",
    "23": "other",
    "24": "parenting",
    "25": "politics/viewpoint",
    "26": "profession",
    "27": "programming",
    "28": "religion/supernatural",
    "29": "rpg",
    "30": "sex/relationships",
    "31": "social_group",
    "32": "software",
    "33": "sports",
    "34": "stem",
    "35": "travel",
    "36": "tv_show",
    "37": "video_game",
    "38": "writing/stories"
  },
  "initializer_range": 0.02,
  "label2id": {
    "advice/question": 0,
    "animals": 1,
    "anime/manga": 2,
    "appearance": 3,
    "arts": 4,
    "autos": 5,
    "board_game": 6,
    "books": 7,
    "card_game": 8,
    "company/website": 9,
    "crypto": 10,
    "drugs": 11,
    "education": 12,
    "electronics": 13,
    "finance/money": 14,
    "food/drink": 15,
    "geo": 16,
    "hardware/tools": 17,
    "health": 18,
    "hobby": 19,
    "meta": 20,
    "movies": 21,
    "music": 22,
    "other": 23,
    "parenting": 24,
    "politics/viewpoint": 25,
    "profession": 26,
    "programming": 27,
    "religion/supernatural": 28,
    "rpg": 29,
    "sex/relationships": 30,
    "social_group": 31,
    "software": 32,
    "sports": 33,
    "stem": 34,
    "travel": 35,
    "tv_show": 36,
    "video_game": 37,
    "writing/stories": 38
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}
